#+TITLE: Debian Stable (Jessie) install
#+AUTHOR: Mathieu Basille

This is a complete tutorial to install Debian Stable (Jessie). See
also the official [[https://www.debian.org/releases/stable/amd64/][Debian installation guide]]. Most of the instructions
are general enough to be applied on any computer. Keep in mind,
however, that:
- Hardware configuration (including keyboard layout) is tuned for a
  laptop *DELL Latitude E6320*;
- The system is in French, with AZERTY keyboard layout.


*** The Debian way

Start by downloading an image of
[[https://www.debian.org/distrib/ftplist][Debian] for Debian Stable
(Jessie), according to the platform of the computer. A good choice is
the Network install (=netinst=), which will fetch all system packages
directly on-line when installing. In this case, download is the ISO
image for USB sticks for amd64
(=debian-8.7.1-amd64-netinst.iso=). Then check [[http://cdimage.debian.org/debian-cd/current/amd64/iso-cd/MD5SUMS][MD5 sums]] to guarantee
the integrity of the file:

#+BEGIN_SRC sh
  md5sum debian-8.7.1-amd64-netinst.iso
#+END_SRC
#+RESULTS:
  : 453312bf56fc45669fec5ebc0f025ac7  debian-8.7.1-amd64-netinst.iso

The next step is to copy the ISO on a USB flash drive. First check
on which device the flash drive is mounted:

#+BEGIN_SRC sh
  df -h
#+END_SRC
#+RESULTS:
  : Filesystem      Size  Used Avail Use% Mounted on
  : /dev/sda1        28G   15G   12G  55% /
  : ...
  : /dev/sda3       204G  195G  2.8G  99% /home
  : tmpfs           789M   40K  789M   1% /run/user/1000
  : /dev/sdb1       7.5G  184K  7.5G   1% /media/<user>/<FLASH>

In this case, this shows that the flash drive is associated to
=sdb1=. Note that we need to write to the whole disk, so we will be
using =sdb=, not the partition =sdb1=.  (WARNING #1: This formats the
entire stick! WARNING #2: Change the value of =sdb= accordingly!
WARNING #3: The =sync= command can take quite a while):

#+BEGIN_SRC sh
  sudo dd if=debian-8.7.1-amd64-netinst.iso of=/dev/sdb1
  sudo sync
#+END_SRC

Now unmount the flash drive, and from now on, all other steps will be
on the 'target' computer.

  : sudo umount /dev/sdb1 


